app/controllers/kosan_controller.rb

SELECT  "kosans".* FROM "kosans" WHERE "kosans"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @session_user = "0"
    if session[:current_user_id] == "111222111222"
      @session_user = "1"
    end
    @kosan = Kosan.find(params[:id])

SELECT  "kosans".* FROM "kosans" WHERE "kosans"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "kosans" SET "nama" = ?, "gambar" = ?, "updated_at" = ? WHERE "kosans"."id" = ?  [["nama", "kosan pak amin dua"], ["gambar", "http://www.ekompas.com/wp-content/uploads/2016/01/kos-kosan.jpg"], ["updated_at", "2017-08-17 02:20:14.853776"], ["id", 22]]
---
  def update
    if session[:current_user_id] == "111222111222"
      @kosan = Kosan.find(params[:id])
      @kosan.update(kosan_params)

SELECT  "kosans".* FROM "kosans" WHERE "kosans"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
  def edit
    @session_user = "0"
    if session[:current_user_id] == "111222111222"
      @session_user = "1"
    end
    if session[:current_user_id] == "111222111222"
      @kosan = Kosan.find(params[:id])

SELECT "kosans".* FROM "kosans"
---
  def index
    @session_user = "0"
    if session[:current_user_id] == "111222111222"
      @session_user = "1"
    end

    @kosans = Kosan.all

INSERT INTO "kosans" ("nama", "lokasi", "deskripsi", "harga", "gambar", "kontak", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    uploaded_io = params[:kos][:gambar]
    File.open(Rails.root.join('public', 'uploads', uploaded_io.original_filename), 'wb') do |file|
      file.write(uploaded_io.read)
    end

    @kosan = Kosan.new(kosan_params) do |t|
      if params[:kos][:gambar]
        t.gambar  = params[:kos][:gambar].original_filename
      end
    end

  #  @kosan = Kosan.new(kosan_params)
    @kosan.save

SELECT  "kosans".* FROM "kosans" WHERE "kosans"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "kosans" WHERE "kosans"."id" = ?  [["id", 7]]
---
  def destroy
    if session[:current_user_id] == "111222111222"
      @kosan = Kosan.find(params[:id])
      @kosan.destroy